# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\214016586\Documents\GitHub\PSoC_2A03APU\APU2A03\APU2A03.cydsn\APU2A03.cyprj
# Date: Tue, 25 Jul 2017 14:20:38 GMT
#set_units -time ns
create_clock -name {Clock_179(routed)} -period 562.5 -waveform {0 281.25} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {DAC_Clk(routed)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_179} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 55} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {Clock_179(fixed-function)} -period 562.5 -waveform {0 20.8333333333333} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {DAC_Clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 193 385} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {MIDI1_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 193 385} [list [get_pins {ClockBlock/dclk_glb_2}]]

set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\214016586\Documents\GitHub\PSoC_2A03APU\APU2A03\APU2A03.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\214016586\Documents\GitHub\PSoC_2A03APU\APU2A03\APU2A03.cydsn\APU2A03.cyprj
# Date: Tue, 25 Jul 2017 14:20:24 GMT
